{"kind":"Scheduled","properties":{"displayName":"New Local Admin Added","enabled":true,"queryFrequency":"PT30M","queryPeriod":"PT6H","triggerOperator":"GreaterThan","triggerThreshold":0,"severity":"Medium","query":"DeviceEvents | where ActionType == \"UserAccountAddedToLocalGroup\" | where AdditionalFields contains \"Administrators\"","eventGroupingSettings":{"aggregationKind":"SingleAlert"}}}