DeviceEvents
| where TimeGenerated > ago(14d)
| where ActionType in ("TamperProtectionFailure","SenseServiceStopped","RealTimeProtectionDisabled")
| project TimeGenerated, DeviceName, ActionType, InitiatingProcessAccountName