// New local admin additions
DeviceEvents
| where ActionType in ("UserAccountAddedToLocalGroup")
| where AdditionalFields contains "Administrators"
| project TimeGenerated, DeviceName, InitiatingProcessAccountName, TargetAccount
