SigninLogs
| extend Country = tostring(LocationDetails.countryOrRegion)
| summarize FirstSeen=min(TimeGenerated), LastSeen=max(TimeGenerated), IPs=dcount(IPAddress) by UserPrincipalName, Country
| where Country !in ("United States") or IPs > 5