{"version":"Notebook/1.0","items":[
 {"type":1,"content":{"json":{"input":{"version":"KqlItem/1.0"},"query":"SecurityAlert | summarize Alerts=count() by bin(TimeGenerated, 1d)","title":"Alerts/day"}}},
 {"type":1,"content":{"json":{"input":{"version":"KqlItem/1.0"},"query":"DeviceEvents | where ActionType == \"UserAccountAddedToLocalGroup\" | summarize Count=count() by bin(TimeGenerated,1d)","title":"Local admin adds"}}}
]}